app/controllers/offers_controller.rb

SELECT "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
def find_offer
    Offer.find(params[:id])