app/controllers/watchlists_controller.rb

SELECT "watchlists".* FROM "watchlists"
---
def index
    render json: Watchlist.all

SELECT "watchlists".* FROM "watchlists" WHERE "watchlists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
def find_watchlist
    Watchlist.find(params[:id])